# Запрашиваем у пользователя целое число и преобразуем его в тип int
number = int(input("Введите целое число: "))

# Проверяем, делится ли число на 2 без остатка
# Если остаток от деления на 2 равен 0, то число четное
if number % 2 == 0:
    # Выводим сообщение о том, что число четное
    print(f"Число {number} является четным")
else:
    # Если остаток от деления на 2 не равен 0, то число нечетное
    # Выводим сообщение о том, что число нечетное
    print(f"Число {number} является нечетным")